app/Models/DaftarKerjaModel.php

    public function getTemanWithKategori()
    {
        return $this->select('teman_kerja.id_teman_kerja, teman_kerja.nama_teman_kerja, kategori_teman.kategori_teman')
                    ->join('kategori_teman', 'teman_kerja.id_kategori_teman = kategori_teman.id_kategori_teman')
                    ->findAll();
---
SELECT `teman_kerja`.`id_teman_kerja`, `teman_kerja`.`nama_teman_kerja`, `kategori_teman`.`kategori_teman`
FROM `teman_kerja`
JOIN `kategori_teman` ON `teman_kerja`.`id_kategori_teman` = `kategori_teman`.`id_kategori_teman`