app/Models/DaftarSMAModel.php

    public function getTemanWithKategori()
    {
        return $this->select('teman_sma.id_teman_sma, teman_sma.nama_teman_sma, kategori_teman.kategori_teman')
                    ->join('kategori_teman', 'teman_sma.id_kategori_teman = kategori_teman.id_kategori_teman')
                    ->findAll();
---
SELECT `teman_sma`.`id_teman_sma`, `teman_sma`.`nama_teman_sma`, `kategori_teman`.`kategori_teman`
FROM `teman_sma`
JOIN `kategori_teman` ON `teman_sma`.`id_kategori_teman` = `kategori_teman`.`id_kategori_teman`