app/Models/DaftarSDModel.php

SELECT `teman_sd`.`id_teman_sd`, `teman_sd`.`nama_teman_sd`, `kategori_teman`.`kategori_teman`
FROM `teman_sd`
JOIN `kategori_teman` ON `teman_sd`.`id_kategori_teman` = `kategori_teman`.`id_kategori_teman`
---
    public function getTemanWithKategori()
    {
        return $this->select('teman_sd.id_teman_sd, teman_sd.nama_teman_sd, kategori_teman.kategori_teman')
                    ->join('kategori_teman', 'teman_sd.id_kategori_teman = kategori_teman.id_kategori_teman')
                    ->findAll();