app/Models/DaftarSMPModel.php

    public function getTemanWithKategori()
    {
        return $this->select('teman_smp.id_teman_smp, teman_smp.nama_teman_smp, kategori_teman.kategori_teman')
                    ->join('kategori_teman', 'teman_smp.id_kategori_teman = kategori_teman.id_kategori_teman')
                    ->findAll();
---
SELECT `teman_smp`.`id_teman_smp`, `teman_smp`.`nama_teman_smp`, `kategori_teman`.`kategori_teman`
FROM `teman_smp`
JOIN `kategori_teman` ON `teman_smp`.`id_kategori_teman` = `kategori_teman`.`id_kategori_teman`