app/Models/DaftarKuliahModel.php

    public function getTemanWithKategori()
    {
        return $this->select('teman_kuliah.id_teman_kuliah, teman_kuliah.nama_teman_kuliah, kategori_teman.kategori_teman')
                    ->join('kategori_teman', 'teman_kuliah.id_kategori_teman = kategori_teman.id_kategori_teman')
                    ->findAll();
---
SELECT `teman_kuliah`.`id_teman_kuliah`, `teman_kuliah`.`nama_teman_kuliah`, `kategori_teman`.`kategori_teman`
FROM `teman_kuliah`
JOIN `kategori_teman` ON `teman_kuliah`.`id_kategori_teman` = `kategori_teman`.`id_kategori_teman`