app/Models/ListTemanModel.php

SELECT * FROM (SELECT `nama_teman_sd` as `nama_teman`, `kategori_teman`.`kategori_teman`, "SD" as `jenjang`
FROM `kategori_teman`
LEFT JOIN `teman_sd` ON `teman_sd`.`id_kategori_teman` = `kategori_teman`.`id_kategori_teman`) `uwrp0`
UNION SELECT * FROM (SELECT `nama_teman_smp` as `nama_teman`, `kategori_teman`.`kategori_teman`, "SMP" as `jenjang` FROM `teman_smp` LEFT JOIN `kategori_teman` ON `teman_smp`.`id_kategori_teman` = `kategori_teman`.`id_kategori_teman`) `uwrp1`

UNION SELECT * FROM (SELECT `nama_teman_sma` as `nama_teman`, `kategori_teman`.`kategori_teman`, "SMA" as `jenjang` FROM `teman_sma` LEFT JOIN `kategori_teman` ON `teman_sma`.`id_kategori_teman` = `kategori_teman`.`id_kategori_teman`) `uwrp2`

UNION SELECT * FROM (SELECT `nama_teman_kuliah` as `nama_teman`, `kategori_teman`.`kategori_teman`, "Kuliah" as `jenjang` FROM `teman_kuliah` LEFT JOIN `kategori_teman` ON `teman_kuliah`.`id_kategori_teman` = `kategori_teman`.`id_kategori_teman`) `uwrp3`

UNION SELECT * FROM (SELECT `nama_teman_kerja` as `nama_teman`, `kategori_teman`.`kategori_teman`, "Kerja" as `jenjang` FROM `teman_kerja` LEFT JOIN `kategori_teman` ON `teman_kerja`.`id_kategori_teman` = `kategori_teman`.`id_kategori_teman`) `uwrp4`
---
    public function getFriendsByCategory()
    {
        $builder = $this->db->table('kategori_teman');

        $builder->select('nama_teman_sd as nama_teman, kategori_teman.kategori_teman, "SD" as jenjang')
                ->join('teman_sd', 'teman_sd.id_kategori_teman = kategori_teman.id_kategori_teman', 'left')
            ->union(
                $this->db->table('teman_smp')
                         ->select('nama_teman_smp as nama_teman, kategori_teman.kategori_teman, "SMP" as jenjang')
                         ->join('kategori_teman', 'teman_smp.id_kategori_teman = kategori_teman.id_kategori_teman', 'left')
            )
            ->union(
                $this->db->table('teman_sma')
                         ->select('nama_teman_sma as nama_teman, kategori_teman.kategori_teman, "SMA" as jenjang')
                         ->join('kategori_teman', 'teman_sma.id_kategori_teman = kategori_teman.id_kategori_teman', 'left')
            )
            ->union(
                $this->db->table('teman_kuliah')
                         ->select('nama_teman_kuliah as nama_teman, kategori_teman.kategori_teman, "Kuliah" as jenjang')
                         ->join('kategori_teman', 'teman_kuliah.id_kategori_teman = kategori_teman.id_kategori_teman', 'left')
            )
            ->union(
                $this->db->table('teman_kerja')
                         ->select('nama_teman_kerja as nama_teman, kategori_teman.kategori_teman, "Kerja" as jenjang')
                         ->join('kategori_teman', 'teman_kerja.id_kategori_teman = kategori_teman.id_kategori_teman', 'left')
            );

        $result = $builder->get()->getResultArray();